src/bankid/exam/tercheck-2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tem="http://tempuri.org/">
    <soapenv:Header>
        <tem:AuthSoapHeader>
            <tem:Login>ukrgas\appmb</tem:Login>
            <tem:Password>$N$q3:ynw=B)_OM}</tem:Password>
        </tem:AuthSoapHeader>
    </soapenv:Header>
    <soapenv:Body>
        <tem:CheckClient>
            <tem:client>
                <tem:RequestId>12334</tem:RequestId>
                <tem:Client>
                    <tem:Name>Захарченко Олександр Володимирович</tem:Name>
                    <tem:Percent>70.00</tem:Percent>
                </tem:Client>
            </tem:client>
        </tem:CheckClient>
    </soapenv:Body>
</soapenv:Envelope>

{
    "code": 1400,
    "result": "error",
    "find": true,
    "time": "Work time is: 32.014 sec.",
    "path": "/openbanking/bankid/client/tercheck",
    "responce": {
        "checkClients": [
            {
                "name": "[Захарченко] [Олександр] Володимирович",
                "weight": "100.00",
                "systemName": "Санкционный список СНБО для физлиц",
                "ruleName": "Замена кириллицы латиницей"
            },
            {
                "name": "[Захарченко] [Олександр] Володимирович",
                "weight": "100.00",
                "systemName": "Санкционный список СНБО для физлиц",
                "ruleName": "Совпадение контекста"
            },
            {
                "name": "[Захарченко] [Олександр] Володимирович",
                "weight": "100.00",
                "systemName": "Санкционный список СНБО для физлиц",
                "ruleName": "Фонетическое подобие"
            }
        ]
    },
    "data": "BankId Клиент [Захарченко Олександр Володимирович] найден в [3][100%] списках: Санкционный список СНБО для физлиц"
}

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tem="http://tempuri.org/">
    <soapenv:Header>
        <tem:AuthSoapHeader>
            <tem:Login>ukrgas\appmb</tem:Login>
            <tem:Password>$N$q3:ynw=B)_OM}</tem:Password>
        </tem:AuthSoapHeader>
    </soapenv:Header>
    <soapenv:Body>
        <tem:CheckClient>
            <tem:client>
                <tem:RequestId>123347</tem:RequestId>
                <tem:Client>
                    <tem:Name>Коваленко Владислав Віталійович</tem:Name>
                    <tem:Percent>80.00</tem:Percent>
                </tem:Client>
            </tem:client>
        </tem:CheckClient>
    </soapenv:Body>
</soapenv:Envelope>


{
    "code": 1400,
    "result": "error",
    "find": true,
    "time": "Work time is: 1.467 sec.",
    "path": "/openbanking/bankid/client/tercheck",
    "responce": {
        "checkClients": [
            {
                "name": "Коваленко#Коваленко  М. С. (3118415577)Відмова від підтримання ділових відносин шляхом їх розірвання у зв’язку з встановленням  неприйнятно високого рівня ризику(переведення безготівкових коштів в готівку)22.05.2019",
                "weight": "100.00",
                "systemName": "Банковский список подозрительных лиц и организаций",
                "ruleName": "Замена кириллицы латиницей"
            },
            {
                "name": "Коваленко#Коваленко  М. С. (3118415577)Відмова від підтримання ділових відносин шляхом їх розірвання у зв’язку з встановленням  неприйнятно високого рівня ризику(переведення безготівкових коштів в готівку)22.05.2019",
                "weight": "100.00",
                "systemName": "Банковский список подозрительных лиц и организаций",
                "ruleName": "Совпадение контекста"
            },
            {
                "name": "Коваленко#Коваленко  М. С. (3118415577)Відмова від підтримання ділових відносин шляхом їх розірвання у зв’язку з встановленням  неприйнятно високого рівня ризику(переведення безготівкових коштів в готівку)22.05.2019",
                "weight": "100.00",
                "systemName": "Банковский список подозрительных лиц и организаций",
                "ruleName": "Фонетическое подобие"
            },
            {
                "name": "Коваленко#Коваленко Інна Олександрівна (2345207806)встановлення неприйнятно високого рівня ризику (відсутність економічної доцільності в проведенні фін.операцій з ц.п. та порушення режиму функціонування рахунків)11.05.2019",
                "weight": "100.00",
                "systemName": "Банковский список подозрительных лиц и организаций",
                "ruleName": "Замена кириллицы латиницей"
            },
            {
                "name": "Коваленко#Коваленко Інна Олександрівна (2345207806)встановлення неприйнятно високого рівня ризику (відсутність економічної доцільності в проведенні фін.операцій з ц.п. та порушення режиму функціонування рахунків)11.05.2019",
                "weight": "100.00",
                "systemName": "Банковский список подозрительных лиц и организаций",
                "ruleName": "Совпадение контекста"
            },
            {
                "name": "Коваленко#Коваленко Інна Олександрівна (2345207806)встановлення неприйнятно високого рівня ризику (відсутність економічної доцільності в проведенні фін.операцій з ц.п. та порушення режиму функціонування рахунків)11.05.2019",
                "weight": "100.00",
                "systemName": "Банковский список подозрительных лиц и организаций",
                "ruleName": "Фонетическое подобие"
            }
        ]
    },
    "data": "BankId Клиент [Коваленко Владислав Віталійович] найден в [6][100%] списках: Банковский список подозрительных лиц и организаций"
}
